app/Controllers/Admin/CompaniesController.php

    protected function getPostcodeAustraliaListListItems($selId = null) {
		$data = [''=>lang('Basic.global.pleaseSelectA', [mb_strtolower(lang('PostcodeAustraliaLists.postcodeAustraliaList'))])];
        if (!empty($selId)) :
            		$postcodeAustraliaListModel = model('App\Models\Admin\PostcodeAustraliaListModel');

            $selOption = $postcodeAustraliaListModel->where('id', $selId)->findColumn('suburb');
---
SELECT `suburb`
FROM `postcode_australia_list`
WHERE `id` = '3417'
AND `postcode_australia_list`.`deleted_at` IS NULL

	protected function getStateListItems($selId = null) {
		$data = [''=>lang('Basic.global.pleaseSelectA', [mb_strtolower(lang('States.state'))])];
        if (!empty($selId)) :
            		$stateModel = model('App\Models\Admin\StateModel');

            $selOption = $stateModel->where('state_id', $selId)->findColumn('state');
---
SELECT `state`
FROM `state`
WHERE `state_id` = '3'
AND `state`.`deleted_at` IS NULL