app/Controllers/Admin/FertilzersController.php

	protected function getCategoryListItems($selId = null) {
		$data = [''=>lang('Basic.global.pleaseSelectA', [mb_strtolower(lang('Categories.category'))])];
        if (!empty($selId)) :
            		$categoryModel = model('App\Models\Admin\CategoryModel');

            $selOption = $categoryModel->where('id', $selId)->findColumn('category');
---
SELECT `category`
FROM `categories`
WHERE `id` = '1'
AND `categories`.`deleted_at` IS NULL