app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
        public function getUserTimeZone($userId)
    {
        $user = $this->find($userId);