app/Libraries/TimezoneConverter.php

    public function getLoggedInUsername()
    {
        try {
            $userId = user_id(); // Get the logged-in user's ID
            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'